'''
Информационная карточка вычислительного эксперимента

Данная программа создает аккуратно оформленную карточку вычислительного эксперимента.

В ней будет доступна информация о:
имени исследователя
названии эксперимента
количестве выполненных запусков — целое число
длительности одного запуска в секундах — вещественное число
действительной и мнимой части комплексного коэффициента — два вещественных числа.
'''
username = input("Имя исследователя: ")
test_name = input("Название эксперимента: ")

test_cnt = int(input("Количество выполненных запусков: "))
test_sec = float(input("Длительность одного запуска в секундах: "))
real_x, imag_y = (float(input("Действительная часть комплексного коэффициента: ")),
                  float(input("Мнимая часть комплексного коэффициента: ")))


sum_sec = test_sec * test_cnt
sum_min = test_sec * test_cnt / 60
complex_coef = complex(real_x, imag_y)
modul_sqr = real_x ** 2 + (complex_coef.imag) ** 2
has_runs = bool(test_cnt)

line = '=' * 50

print (line,
    f'ЭКСПЕРЕМЕНТ: {test_name}',
    f'Исследователи: {username}',
    f'Запуски: {test_cnt}',
    f'Общее время: {sum_sec:.2f} с ({sum_min:.2f} мин)',
    f'Коэффицент: {complex_coef}',
    f'Квадрат модуля: {modul_sqr:.2f}',
    f'Есть выполненные запуски: {has_runs}',
    line, sep='\n'
       )
print ('\n')
print(f"Диагностика типов введённых данных:\n"
      f"Имя: {type(username)}\n"
      f"Эксперимент: {type(test_name)}\n"
      f"Кол-во запусков: {type(test_cnt)}\n"
      f"Длительность: {type(test_sec)}\n"
      f"Действительная часть: {type(real_x)}\n"
      f"Мнимая часть: {type(imag_y)}"
      )
